УРВ_файловая/src/Documents/Обращение/Обращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Обращение</name>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <registerRecords>InformationRegister.ГолосаПользователейЗаПожелания</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияОбращений</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентОбслуживающейОрганизации</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПереписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.КаналыПолученияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаБазыЗнаний</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.КомпонентыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПрикрепилКарточку</name>
    <comment>Пользователь, который прикрепил к обращению карточку базы знаний</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСокращенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжиданиеОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаНаТариф</name>
    <type>
      <types>DocumentRef.Подписка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученНовыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннееОбращение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнутренними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнешними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбращенияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеОбращения</name>
    <attributes>
      <name>Обращение</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Documents/Обращение/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
    КонецЕсли;
    
    Поля = Новый Массив;
    Поля.Добавить("Осталось");
    Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
    Список.УстановитьОграниченияИспользованияВОтборе(Поля);
	
	УстановитьУсловноеОформление();
	
	Если Не УправлениеДоступомУСПВызовСервера.ДоступныПользователиСервиса() Тогда
		Элементы.Инициатор.Видимость = Ложь;
	КонецЕсли;
	
    Список.Параметры.УстановитьЗначениеПараметра("НизкаяВажность", Перечисления.ВариантыВажности.НизкаяВажность);
    Список.Параметры.УстановитьЗначениеПараметра("ВысокаяВажность", Перечисления.ВариантыВажности.ВысокаяВажность);
	Список.Параметры.УстановитьЗначениеПараметра("ТипКонсультация", Перечисления.ТипыОбращений.Консультация);
	Список.Параметры.УстановитьЗначениеПараметра("ТипОшибка", Перечисления.ТипыОбращений.Ошибка);
	Список.Параметры.УстановитьЗначениеПараметра("ТипПожелание", Перечисления.ТипыОбращений.Пожелание);
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяУниверсальнаяДата());
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Элементы.СписокНастроитьАвтообновление.Видимость = Ложь;
	Иначе
		НастройкиАвтообновления = Автообновление.ПолучитьНастройкиАвтообновленияФормы(ЭтаФорма);
		Элементы.СписокНастроитьАвтообновление.Видимость = Истина;
    КонецЕсли;
    
	Если Параметры.Отбор.Свойство("Абонент") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Обращения абонента'"); 
    ИначеЕсли Параметры.Отбор.Свойство("Инициатор") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Обращения пользователя'"); 
		Элементы.Инициатор.Видимость = Ложь;
	КонецЕсли;
	
	//{Рарус kruser 25.04.2019 84132
	ДобавитьКомандуСоздатьВнутреннееОбращение();
	//}Рарус kruser 25.04.2019 84132	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//{Рарус kruser 10.06.2019 87760
	Если УРВСервер.ПроверитьДоступностьРолиКлиентКомпании() Тогда		
		Отказ = Истина;		
		ОткрытьФорму("Документ.Обращение.Форма.ФормаСпискаКлиентаКомпании");			
	КонецЕсли;
	//}Рарус kruser 10.06.2019 87760

	ТекущаяДатаКлиента = ТекущаяДата();
	
	Список.Параметры.УстановитьЗначениеПараметра("СекундДоМестногоВремени",
		ТекущаяДатаКлиента - УниверсальноеВремя(ТекущаяДатаКлиента));
	
	#Если Не ВебКлиент Тогда
		УстановитьАвтообновлениеФормы();
	#КонецЕсли
	
КонецПроцедуры

//{Рарус kruser 25.04.2019 84132
&НаСервере
Процедура ДобавитьКомандуСоздатьВнутреннееОбращение()
	
	Если РольДоступна(Метаданные.Роли.СозданиеВнутреннихОбращений) Или Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		НоваяКомандаФормы = ЭтаФорма.Команды.Добавить("СоздатьВнутреннееОбращение");
		НоваяКомандаФормы.Действие = "СоздатьВнутреннееОбращение";
		НоваяКомандаФормы.Заголовок = "Создать внутреннее обращение";  
		
		НовыйЭлемент = Элементы.Вставить("СоздатьВнутреннееОбращение", Тип("КнопкаФормы"), Элементы.КоманднаяПанельФормы, Элементы.КоманднаяПанельФормы.ПодчиненныеЭлементы.СписокСкопировать);
		НовыйЭлемент.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.Заголовок		= "Внутреннее обращение";
		НовыйЭлемент.ИмяКоманды		= "СоздатьВнутреннееОбращение";	
		НовыйЭлемент.Отображение 	= ОтображениеКнопки.КартинкаИТекст;
		НовыйЭлемент.Картинка		= БиблиотекаКартинок.СоздатьЭлементСписка;
		
	ИначеЕсли Не РольДоступна(Метаданные.Роли.ПросмотрВнутреннихОбращений) Тогда  	
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ВнутреннееОбращение");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;		
		ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение 	= Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры
//}Рарус kruser 25.04.2019 84132

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьВРаботу(Команда)
	
    Ссылки = ОбслуживаниеКлиент.СсылкиИзСтрокСписка(Элементы.Список.ВыделенныеСтроки);
    ПринятьВРаботуНаСервере(Ссылки);
    ОбслуживаниеКлиент.ПринятьОбращенияВРаботуЗавершение(Ссылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиНаЛинию(Команда)
	
    Ссылки = ОбслуживаниеКлиент.СсылкиИзСтрокСписка(Элементы.Список.ВыделенныеСтроки);
	ПеревестиНаЛиниюНаСервере(Ссылки);
    ОбслуживаниеКлиент.ПеревестиОбращенияНаЛиниюЗавершение(Ссылки);
	
КонецПроцедуры  

&НаКлиенте
Процедура Перенаправить(Команда)
	
    Оповещение = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект);
	ОбслуживаниеКлиент.ПеренаправитьОбъекты(Элементы.Список.ВыделенныеСтроки, Тип("ДокументСсылка.Обращение"), Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ВыполнитьОбновлениеСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАвтообновление(Команда)
	
	УстановитьПараметрыАвтообновленияФормы();
	
КонецПроцедуры

//{Рарус kruser 25.04.2019 84132
&НаКлиенте
Процедура СоздатьВнутреннееОбращение(Элемент)
	
	ПараметрыФормы = Новый Структура("ВнутреннееОбращение", Истина);		
	ОткрытьФорму("Документ.Обращение.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры
//}Рарус kruser 25.04.2019 84132

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ПринятьВРаботу", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ПеревестиНаЛинию", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "Перенаправить", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаБизнесПроцессПоручениеСоздатьПоручение", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияЗарегистрироватьЗвонок", Элемент.ТекущаяСтрока <> Неопределено);
    ОбщегоНазначенияУСПКлиентСервер.УстановитьДоступностьЭлементаФормы(
        ЭтотОбъект, "ФормаЖурналДокументовВзаимодействияНаписатьЭлектронноеПисьмо", Элемент.ТекущаяСтрока <> Неопределено);
        
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
    
    Для Каждого Строка Из Строки Цикл
        ОсталосьОформление = Строка.Значение.Оформление.Получить("Осталось");
        Если ЗначениеЗаполнено(ОсталосьОформление) Тогда
            ОсталосьОформление.УстановитьЗначениеПараметра("Текст", ОбщегоНазначенияУСПКлиентСервер.ДниЧасыМинуты(Строка.Значение.Данные.Осталось));
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПринятьВРаботуНаСервере(Ссылки)
    
	Обслуживание.ПринятьОбъектыВРаботу(Ссылки, Элементы.Список);
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиНаЛиниюНаСервере(Ссылки)
    
	Обслуживание.ПеревестиОбъектыНаЛинию(Ссылки, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьЗавершение(Результат, ПараметрыОповещения) Экспорт
    
    Если Результат <> Неопределено И Результат.МассивОбъектов.Количество() > 0 Тогда
        ПеренаправитьЗавершениеНаСервере();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПеренаправитьЗавершениеНаСервере()
    
    Элементы.Список.Обновить();
    
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформлениеСпискаОбращений = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	УсловноеОформлениеСпискаОбращений.ИдентификаторПользовательскойНастройки = "ОсновноеОформление";
	
	// удаление предустановленных элементов оформления
	Предустановленные = Новый Массив;
	ЭлементыОформления = УсловноеОформлениеСпискаОбращений.Элементы;
	Для каждого ЭлементУсловногоОформления Из ЭлементыОформления Цикл
		Если ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			Предустановленные.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементУсловногоОформления Из Предустановленные Цикл
		ЭлементыОформления.Удалить(ЭлементУсловногоОформления);
	КонецЦикла;
	
	// Оформление при срыве сроков реакции
	ЭлементУсловногоОформления = УсловноеОформлениеСпискаОбращений.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокРеакцииСорван");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокОбработкиСорван");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПредупреждениеЦвет);
	
	// Оформление при срыве сроков обработки
	ЭлементУсловногоОформления = УсловноеОформлениеСпискаОбращений.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокОбработкиСорван");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
		
КонецПроцедуры

&НаКлиенте
Процедура Автообновление()
	
	Если ТипЗнч(НастройкиАвтообновления) <> Тип("Структура")
		Или (ТипЗнч(НастройкиАвтообновления) = Тип("Структура")
		И Не НастройкиАвтообновления.Автообновление) Тогда
		ОтключитьОбработчикОжидания("Автообновление");
	Иначе
		ОбновитьРезультатВыполнения = Ложь;
		ВыполнитьОбновлениеСписка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтообновлениеФормы()
	
	Если ТипЗнч(НастройкиАвтообновления) = Тип("Структура")
		И НастройкиАвтообновления.Автообновление Тогда
		ПодключитьОбработчикОжидания(
			"Автообновление", 
			НастройкиАвтообновления.ПериодАвтоОбновления,
			Ложь);
	Иначе
		ОтключитьОбработчикОжидания("Автообновление");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ВыполнитьОбновлениеСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяУниверсальнаяДата());
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыАвтообновленияФормы()
	
	ОписаниеОповещения = 
		Новый ОписаниеОповещения(
			"УстановитьПараметрыАвтообновленияФормыПродолжение",
			ЭтотОбъект);
	
	АвтообновлениеКлиент.УстановитьПараметрыАвтообновленияФормы(
		ЭтаФорма, 
		НастройкиАвтообновления,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыАвтообновленияФормыПродолжение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкиАвтообновления = Результат;
		УстановитьАвтообновлениеФормы();
	КонецЕсли;
	
КонецПроцедуры

//{Рарус_shav 2018.11.26 75946
&НаКлиенте
Процедура ОбращениеЧерезПомощник(Команда)
	ОткрытьФорму("Обработка.АРМРегистрацииОбращений.Форма.Форма");
КонецПроцедуры
//}Рарус_shav 2018.11.26 75946


#КонецОбласти
